
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                              |
|:--------:|:---------------------------------------------------------------------------------------|
|    🟢     | `module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]` |
|    🟢     | `module.repos["terraform-aws-state-manager"].github_repository.repo`                   |
|    🟢     | `module.repos["terraform-aws-state-manager"].github_team_repository.dev`               |
|    🟢     | `data.external.env:`                                                                   |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/c7fb9f6f-a042-4b9b-89b0-552bf8e5d409/terraform-bin plan -var-file=configuration.tfvars -no-color --out=tf.plan
data.external.env: Reading...
data.external.env: Read complete after 0s [id=-]
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
github_team_members.dev: Refreshing state... [id=7332815]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 1s [id=us-west-1]
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 1s [id=gh_secrets_namespace]
aws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]
data.aws_secretsmanager_secret_version.codacy_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]
module.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]
module.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]
module.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]
module.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]
module.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]
module.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]
module.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]
module.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]
module.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]
module.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]
module.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]
module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]
module.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]
module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]
module.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]
module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]
module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]
module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]
module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]
module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]
module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]
module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]
module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]
module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]
module.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]
module.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]
module.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]
module.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]
module.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]
module.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]
module.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]
module.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]
module.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]
module.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]
module.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform-aws-state-manager"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["terraform-aws-state-manager"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module create an IAM role that can manage a Terraform state"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-state-manager"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["terraform-aws-state-manager"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-state-manager"
      + team_id    = "7332815"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.external.env: Reading...%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 1s [id=us-west-1]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 1s [id=gh_secrets_namespace]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "terraform-aws-state-manager"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["terraform-aws-state-manager"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Module create an IAM role that can manage a Terraform state"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "terraform-aws-state-manager"%0A      + node_id                     = (known after apply)%0A      + primary_language            = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + topics                      = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["terraform-aws-state-manager"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "terraform-aws-state-manager"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvYzdmYjlmNmYtYTA0Mi00YjliLTg5YjAtNTUyYmY4ZTVkNDA5L3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLW5vLWNvbG9yIC0tb3V0PXRmLnBsYW5cbmRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkaW5nLi4uXG5kYXRhLmV4dGVybmFsLmVudjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9LV1cbm1vZHVsZS5paDhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbmdpdGh1Yl9vcmdhbml6YXRpb25fc2V0dGluZ3MuaW5mcmFob3VzZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTIxOTg0MjYzXVxuZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV1cbmdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cbm1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tdGVtcGxhdGVdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpha3V6bWluc2t5XVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVxuZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfcHJvdGVjdGlvbi5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1CUFJfa3dET0kydnU3TTRDQWljaV1cbm1vZHVsZS5paF90Zl90ZW1wbGF0ZS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tdGVtcGxhdGVdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9dXMtd2VzdC0xXVxuZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdXG5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmNvZGFjeV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJdXG5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHXVxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZGluZy4uLlxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJ8QVdTQ1VSUkVOVF1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHfEFXU0NVUlJFTlRdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dXG5tb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3hdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya11cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG86R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDc6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJQWVBJX0FQSV9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQ09EQUNZX1BST0pFQ1RfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpDT0RBQ1lfUFJPSkVDVF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwcm94eXNxbC1zYW5kYm94XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya11cbm1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLWNvbV1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnB1cHBldC1jb2RlXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfYWN0aW9uc19zZWNyZXRcIiBcInNlY3JldFwiIHtcbiAgICAgICsgY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBsYWludGV4dF92YWx1ZSA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICArIHJlcG9zaXRvcnkgICAgICA9IFwidGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJcbiAgICAgICsgc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiXG4gICAgICArIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIge1xuICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFsbG93X3JlYmFzZV9tZXJnZSAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBkZWZhdWx0X2JyYW5jaCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiTW9kdWxlIGNyZWF0ZSBhbiBJQU0gcm9sZSB0aGF0IGNhbiBtYW5hZ2UgYSBUZXJyYWZvcm0gc3RhdGVcIlxuICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZ2l0X2Nsb25lX3VybCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICArIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaHR0cF9jbG9uZV91cmwgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIlxuICAgICAgKyBtZXJnZV9jb21taXRfdGl0bGUgICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIlxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXG4gICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpbWFyeV9sYW5ndWFnZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0b3BpY3MgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICArIGV0YWcgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBlcm1pc3Npb24gPSBcInB1c2hcIlxuICAgICAgKyByZXBvc2l0b3J5ID0gXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIlxuICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCJcbiAgICB9XG5cblBsYW46IDMgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmV4dGVybmFsLmVudjogUmVhZGluZy4uLiUwQWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXSUwQW1vZHVsZS5paDhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdJTBBZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdJTBBZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV0lMEFnaXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5X2NvbGxhYm9yYXRvci5jb2xsYWJvcmF0b3JzW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6YWt1em1pbnNreV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dJTBBZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0cy5naF9zZWNyZXRzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD11cy13ZXN0LTFdJTBBZGF0YS5hd3Nfc3NtX3BhcmFtZXRlci5naF9zZWNyZXRzX25hbWVzcGFjZTogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9Z2hfc2VjcmV0c19uYW1lc3BhY2VdJTBBYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5jb2RhY3lfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyXSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEddJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMnxBV1NDVVJSRU5UXSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHfEFXU0NVUlJFTlRdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdJTBBbW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGVdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwbzpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXI6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNzpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJQWVBJX0FQSV9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkNPREFDWV9QUk9KRUNUX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6Q09EQUNZX1BST0pFQ1RfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlcl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnByb3h5c3FsLXNhbmRib3hdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb10lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya10lMEFtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtY29tXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtdG9vbGtpdF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnB1cHBldC1jb2RlXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7JTBBICAgICAgKyBjcmVhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgICsgcmVwb3NpdG9yeSAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIiUwQSAgICAgICsgc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiJTBBICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG8gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7JTBBICAgICAgKyBhbGxvd19hdXRvX21lcmdlICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgYWxsb3dfbWVyZ2VfY29tbWl0ICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYWxsb3dfc3F1YXNoX21lcmdlICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYXJjaGl2ZWQgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlbGV0ZV9icmFuY2hfb25fbWVyZ2UgICAgICA9IGZhbHNlJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgICAgICAgPSBcIk1vZHVsZSBjcmVhdGUgYW4gSUFNIHJvbGUgdGhhdCBjYW4gbWFuYWdlIGEgVGVycmFmb3JtIHN0YXRlXCIlMEEgICAgICArIGV0YWcgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZ1bGxfbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGhhc19pc3N1ZXMgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGh0bWxfdXJsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1lcmdlX2NvbW1pdF9tZXNzYWdlICAgICAgICA9IFwiUFJfVElUTEVcIiUwQSAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCIlMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICAgICAgICA9IFwidGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaW1hcnlfbGFuZ3VhZ2UgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIlMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIlMEEgICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXYgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiZ2l0aHViX3RlYW1fcmVwb3NpdG9yeVwiIFwiZGV2XCIgeyUwQSAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwZXJtaXNzaW9uID0gXCJwdXNoXCIlMEEgICAgICArIHJlcG9zaXRvcnkgPSBcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiJTBBICAgICAgKyB0ZWFtX2lkICAgID0gXCI3MzMyODE1XCIlMEEgICAgfSUwQSUwQVBsYW46IDMgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQVx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMCUwQSUwQVNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuJTBBJTBBVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6JTBBICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAzLCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```
</p></details>